import CommonTop from '@layouts/common/CommonTop';
import { Box, Typography } from '@mui/material';
import React from 'react'


const TermsOfGaga = () => {
    
  return (
    <>
    <Box
      sx={{
        padding: '20px',  // 페이지 내부의 여백
        '@media (max-width:600px)': {  // 화면 너비가 600px 이하일 때
          padding: '10px',
        },
      }}
    >
      <Typography variant="h5" style={{ marginTop: "50px", paddingLeft: "12px", paddingRight: "12px" }}>Gaga 이용약관</Typography>
      <Typography variant="body1">
      제1조 [목적]<br/>
      이 약관은 ‘Gaga’(이하 “Gaga” 또는 “회사”) 가 운영하는 모임 서비스 (이하 “서비스”)와 관련하여 “회사”와 이용자의 권리, 의무, 책임사항, 운영수칙, 
      기타 필요한 사항을 규정함을 목적으로 합니다.<br/>
      <br/>
      제 2 조 [용어의 정의]<br/>
이 약관에서 사용하는 용어의 정의는 다음과 같습니다<br/>

(1) 이용자: “사이트”에 접속하여 이 약관에 따라 “회사”가 제공하는 “서비스”를 받는 회원 및 비회원을 말하며, “사이트”가 제공하는 “서비스”를 지속적으로 이용할 수 있는 자를 말합니다.<br/>

(2) 회원: “회사”의 “사이트”에 개인정보를 제공하여 회원 등록을 한 자로서, “회사”의 정보를 지속적으로 제공받으며, 이 약관에 따라 “회사”와 “서비스” 이용계약을 체결한 자를 말합니다.<br/>

(3) 서비스: 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함) 혹은 물리적 형태와 상관없이 “회사”가 “회원”에게 제공하여 “회원”이 이용할 수 있는 모든 서비스를 의미합니다.<br/>

(4) 유료서비스: “회사”가 유료로 제공하는 각종 온오프라인콘텐츠 및 제반 서비스를 의미합니다.<br/>

(5) 클럽,미팅: “이용자”간에 취향과 관심사와 관련된 온오프라인콘텐츠를 기반으로 진행되는 원데이 모임으로 콘텐츠의 성질에 따라 유료 혹은 무료로 진행됩니다.<br/>

(6) 본 약관에서 정의하지 않는 용어는 관계법령이 정하는 바에 따르며, 그 외에는 일반적인 상관례를 따릅니다.<br/>
<br/>
제 3 조 [약관의 명시와 설명 및 개정]<br/>
1. “회사”는 이 약관의 내용과 상호 및 대표자 이름, 소재지 주소, 전자우편주소 등을 “회원”이 알기 쉽게 “초기 서비스 화면”에 게시합니다. 
    다만, 약관의 구체적 내용은 이용자가 연결화면을 통하여 볼 수 있도록 합니다.<br/>

2. “회사”는 “전자상거래 등에서의 소비자보호에 관한 법률”, “약관의 규제 등에 관한 법률”, “전자거래 기본법”, “전자 서명법“, “정보통신망 이용촉진 등에 관한 법률“,
     “소비자 기본법“등 관계법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.<br/>

3. “회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 “사이트”의 초기화면에 최소 그 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 
    다만, 이용자에게 불리하게 약관의 내용을 변경하는 경우에는 적용일자 30일 이전부터 공지합니다.<br/>

4. 제3항에 따라 공지된 적용일자 이후에 회원이 “회사”의 “서비스”를 계속 이용하는 경우에는 개정된 약관에 동의하는 것으로 봅니다. 
    개정된 약관에 동의하지 아니하는 회원은 언제든지 자유롭게 “서비스” 이용계약을 해지할 수 있습니다.<br/>

5. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 정부가 제정한 전자거래소비자보호지침 및 관계법령 또는 일반 상 관례에 따릅니다.<br/>
<br/>
제 4 조 [이용계약의 성립]<br/>
1. 이용계약은 회원이 되고자 하는 자(이하 가입신청자)가 약관의 내용에 대하여 동의를 하고 ”회사”가 정한 가입양식에 따라 회원 가입 신청을 하고, 
    “회사”가 이러한 신청에 대하여 승낙함으로써 체결됩니다.<br/>

2. 이용계약은 관련법령에 의거 만 14세 미만의 회원 가입이 제한됩니다.<br/>
<br/>
제 5조 [이용신청 및 승낙]<br/>
1. 회원은 “회사”가 정한 가입 양식에 따라 회원정보를 기입한 후 가입 의사를 표시함으로써 이용계약을 신청합니다.<br/>

2. “회사”는 다음 각 호에 해당하는 이용신청에 대하여는 이를 승낙하지 아니하거나 사후에 이용계약을 해지할 수 있습니다.<br/>

(1) 이미 가입된 회원과 아이디(이메일 주소)가 동일한 경우<br/>

(2) 실명이 아니거나 타인의 명의를 이용한 경우<br/>

(3) 부정한 용도 또는 영리를 추구할 목적으로 본 “서비스”를 이용하고자 하는 경우<br/>

(4) “회사”에 의하여 이용계약이 해지된 날로부터 6개월 이내에 재이용을 신청하는 경우<br/>

(5) “회사”가 정한 가입양식을 기재함에 있어 허위의 정보를 기재하거나, 기재를 누락하거나, 오기가 있는 경우<br/>

(6) 14세 미만 아동이 법정대리인(부모 등)의 동의를 얻지 아니한 경우<br/>

(7) 관련법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우<br/>

(8) “회사”가 제공하는 각 약관 내지 관련 법령에 위배되거나 위배될 가능성이 있는 부당한 이용신청임이 확인된 경우<br/>

(9) 기타 회원과의 계속적 거래관계를 지속하기 어렵다고 합리적으로 판단되는 경우<br/>

(10) 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우<br/>

(11) “회사”의 “서비스” 운영에 필요한 관련 설비의 여유가 없거나, 업무상 또는 기술상 지장이 있는 경우<br/>

(12) “회사”의 “서비스”이용 원칙을 담은 이용 가이드 규정을 위반하여 “서비스” 이용 규정에 의거하여 이용 제재를 받은 경우<br/>

3. 제1항에 따른 신청에 있어 “회사”는 회원의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.<br/>

4. 이용계약의 성립시기는 “회사”가 가입완료를 신청절차상에서 표시한 시점으로 합니다.<br/>

5. “회사”는 회원에 대해 “회사”정책에 따라 등급별로 구분하여 이용시간, 이용횟수, “서비스” 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.<br/>

6. “회사”는 회원에 대하여 영화및비디오물의진흥에관한법률 및 청소년보호법등에 따른 등급 및 연령 준수를 위해 이용제한이나 등급별 제한을 할 수 있습니다.<br/>
<br/>
제 6 조 [회원정보의 수정]<br/>
1. 회원은 회원가입 신청 시 기재한 사항이 변경되었을 경우 Gaga “서비스”에서 개인정보관리 화면을 통하여 직접 수정을 하거나 
    전자우편이나 기타 방법으로 “회사”에 대하여 그 변경사항을 알려야 합니다.<br/>

2. 제1항의 변경사항을 “회사”에 알리지 않아 발생한 불이익에 대하여 “회사”는 책임지지 않습니다.<br/>
<br/>
제 7 조 [이용계약의 종료]<br/>
1. 회원의 해지<br/>

(1) 회원은 언제든지 “회사”에게 해지의사를 통지함으로써 이용계약을 해지할 수 있습니다.<br/>

(2) 이용계약은 “회사”가 회원의 해지의사를 받아 해지 처리하는 시점에 종료됩니다.<br/>

(3) 본 항에 따라 해지를 한 회원은 이 약관이 정하는 회원가입절차와 관련조항에 위반되지 않는 경우 회원으로 다시 가입할 수 있습니다. 
    {/* 단, 해지 시점 6개월 후부터 재이용이 가능합니다.*/}<br/> 

2. “회사”의 해지<br/>

(1) “회사”는 5조 2항에서 정하고 있는 이용계약의 해지사유가 있는 경우 회원과의 이용계약을 해지할 수 있습니다.<br/>
{/* 
(2) “회사”는 해당 회원에게 14일 이내의 기간을 정하여 사전에 해지사유에 대한 의견진술의 기회를 부여할 수 있습니다.<br/> */}
<br/>
제 8조 [이용제한 등]<br/>
1. “회사”는 “회원”이 다음 각 호의 사유에 해당하는 경우 경고 조치를 통해 시정을 요구하고, 해당 사유에 대하여 지체 없이 시정이 이뤄지지 않는 경우 
    호스트에 대한 위반사항 게시, 일시정지 또는 영구이용정지 등으로 “서비스”의 이용을 단계적으로 제한할 수 있습니다. 
    다만, 그 정도가 과도하다고 판단될 경우에는 회복할 수 없는 손해를 방지하기 위하여 회원에 대한 별도 경고 없이 즉시 일시정지 조치를 할 수 있으며, 
    중대한 범죄와 관련된다고 판단되는 경우 민형사상 조치와 함께 회원자격의 영구이용정지 조치를 통해 “서비스” 이용을 제한할 수 있습니다.<br/>

(1) 가입 신청 시 허위 내용을 등록한 경우<br/>

(2) 물품 또는 “서비스”에 대한 대금 결제, 기타 “서비스” 이용과 관련하여 회원이 부담하는 채무를 기일에 이행하지 않는 경우<br/>

(3) 타인의 “서비스” 이용을 방해하거나 정보를 도용하는 등 전자상거래 질서를 위협하는 경우<br/>

(4) “회사”를 이용하여 법령과 이 약관이 금지하거나 공공질서, 미풍양속에 반하는 행위를 하는 경우<br/>

(5) “회원”이 “회사” 시스템이나 “서비스”를 경유하지 않고 직접 거래할 목적으로 회원 간에 
    개인정보, 연락처 등(전화번호, 이메일, 메신저, SNS ID 등을 포함하되 이에 한정되지 아니함)를 교환하거나, 
    “클럽”,“미팅” 상세 소개페이지, 라운지, 후기, 이미지, 리뷰 등에 위 개인정보, 연락처 등을 기재하거나 기재하도록 유도하는 경우<br/>

(6) 이용자가 “회사” 시스템이나 “서비스”를 경유하지 않고 호스트에게 대가를 직접 지급한 경우<br/>

(7) 호스트에게 “클럽”,“미팅” 등과 관련 없거나 불쾌한 언어사용, 비정상적인 행위 등을 한 것에 대하여 신고가 접수된 경우<br/>

(8) 고객센터 문의 및 전화 상담 내용이 욕설, 폭언, 성희롱, 반복 민원을 통한 업무방해 등에 해당하는 경우<br/>

2. “회사”는 전항에도 불구하고 저작권법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 여신전문금융업법 등 기타 현행법령을 위반한 명의도용 및 결제정보 도용, 
    불법 통신 및 해킹, 악성프로그램의 배포, 접속권한 초과, 신용카드 부정거래 등의 경우에 즉시 영구이용정지를 할 수 있습니다.<br/>

3. “회원”은 본조에 따른 이용제한의 경우 고객센터를 통하여 소명자료를 구비하여 이의를 제기할 수 있습니다. 
    “회사”가 회원의 이의제기 및 소명이 충분하다고 판단하는 경우 “회원”의 “서비스” 이용을 즉시 재개할 수 있습니다.<br/>
<br/>
제 9 조 [개인정보보호 의무]<br/>
1. “회사”는 “회원”의 개인정보를 보호하기 위해 정보통신망법 등 관계 법령이 정하는 바를 준수합니다. 
    다만, 이용자의 귀책사유로 인해 노출된 정보에 대해 “회사”는 일체의 책임을 지지 않습니다.<br/>

2. 개인정보의 보호 및 사용에 대해서는 관련법 및 “회사”의 개인정보취급방침이 적용됩니다. 다만, 
    “회사”의 공식 “서비스” 이외의 링크된 “서비스”에서는 “회사”의 개인정보취급방침이 적용되지 않습니다.<br/>
<br/>
제 10 조 [회원의 아이디 및 비밀번호의 관리에 대한 의무]<br/>
1. 회원의 아이디(E-mail)와 비밀번호에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.
     회원이 아이디(E-mail)와 비밀번호를 제3자에게 알려줌으로써 발생한 손해에 대해서는 “회사”는 책임을 지지 않습니다.<br/>

2. “회사”는 플랫폼에서 “회원”이 사용하는 이름 또는 닉네임이 개인정보 유출 우려가 있거나, 
    반사회적 또는 미풍양속에 어긋나거나 “회사” 및 “회사”의 운영자로 오인한 우려가 있는 경우, 해당 이름 또는 닉네임의 이용을 제한할 수 있습니다.<br/>

3. 회원은 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 “회사”에 통지하고 “회사”의 안내에 따라야 합니다. 
    이를 소홀히 하여 발생한 모든 민∙형사상 책임은 회원이 집니다.<br/>

4. 제3항의 경우에 해당 회원이 “회사”에 그 사실을 통지하지 않거나, 통지한 경우에도 “회사”의 안내에 따르지 않아 발생한 불이익에 대하여 “회사”는 책임지지 않습니다.<br/><br/>

제 11 조 [회원에 대한 통지]<br/>
1. “회사”가 회원에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 “회원”이 제출한 전자우편주소, 전자쪽지, 문자메시지, PUSH 등으로 할 수 있습니다.<br/>

2. “회사”는 불특정 다수 회원에 대한 통지를 할 경우, 7일 이상 “회사”의 “사이트”에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.<br/><br/>

제 12 조 [“회사”의 의무]<br/>
1. “회사”는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 
    이 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.<br/>

2. “회사”는 이용자가 안전하게 서비스를 이용할 수 있도록 “이용자”의 개인정보(신용정보 포함) 보호를 위해 보안시스템을 갖추어야 하며 
    개인정보취급방침을 공시하고 준수합니다.<br/>

3. “회사”는 관련 법령이 정한 의무사항을 준수합니다.<br/><br/>

제 13 조 [회원의 의무]<br/>
1. “회원”은 관련법과 이 약관의 규정이 규정한 내용, “사이트”에 명시된 이용안내 및 개별 서비스 이용 조건 등 “회사”가 통지하는 사항을 준수하여야 하며, 
    기타 타인의 권익을 침해하거나 “회사” 업무에 방해되는 행위를 하여서는 안됩니다.<br/>

2. “회원”이 “서비스”를 이용하는 것은 “회원”이 적용 가능한 모든 법률, 규범 및 규정을 준수함에 동의하는 것 입니다. 
    또한 “회원”은 “서비스”이용을 규정하는 특정 추가 규범(이하 “”행동 규범””)을 준수함에 동의합니다. 행동 규범은 모든 내용을 담고 있는 것은 아니며, 
    “회사”는 특정 행동이 금지 목록에 있는지에 관계없이 “서비스”의 완전함과 속성을 보호하기 위해 (”회원”에게 통지하고) 환불, 
    영구 정지를 포함한 적합한 징계 조치를 취할 수 있음은 물론 언제라도 이 행동 규범을 수정할 권한을 보유합니다. 
    이러한 행동 규범 외에도, 모범적인 “서비스”이용 행동 및 제재조치들에 대한 자세한 안내는 플랫폼의 규율 및 운영정책을 참고하십시오. 
    다음은 제재 조치가 따르는 행동의 예시를 나열한 것으로 이에 국한되지 않습니다.<br/>

(1) 이용 계약 신청 또는 변경 시 허위내용의 등록<br/>

(2) 타인의 정보도용<br/>

(3) “회사”의 “서비스”에 게시된 정보 또는 회원이 “서비스”를 이용하여 얻은 정보를 “회사”의 사전 승낙 없이 영리 또는 비영리의 목적으로 
    복제, 출판, 방송 등에 사용하거나 제 3자에게 제공하는 행위<br/>

(4) “회사”가 게시한 정보의 허가 받지 않은 변경<br/>

(5) “회사”가 게시한 정보의 변경<br/>

(6) “회사”와 기타 제3자의 저작권 등 지적재산권에 대한 침해<br/>

(7) “회사” 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위<br/>

(8) “회사”, 다른 “회원” 및 제3자에 대한 혐오 발언, 인권 침해, 성희롱 등을 포함한 언어 및 비언어 폭력 행위<br/>

(9) 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위<br/>

(10) 회사가 제공하는 “서비스”를 이용하여 본인 또는 제3자를 홍보하거나, 홍보할 기회를 제공하는 행위<br/>

(11) 회사가 제공하는 “서비스” 및 사이트를 이용하여 본인을 홍보하거나 제3자의 홍보를 대행하는 등의 방법으로 금전을 수수하는 행위<br/>

(12) 회사의 “서비스”를 이용할 권리를 양도하고 이를 대가로 금전을 수수하는 행위<br/>

(13) 기타 불법적이거나 부당한 행위<br/>

(14) 다른 회원의 아이디 및 비밀번호를 도용하여 “서비스”를 이용하는 행위<br/><br/>

제 14 조 [서비스의 제공 및 변경]<br/>
1. “회사”는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경 또는 중단할 수 있습니다.<br/>

2. 서비스의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 “서비스”의 내용 및 제공일자 등은 
    그 변경 전에 “서비스” 화면, 전자메일 등으로 통지해야 합니다.<br/>

3. “회사”는 무료로 제공되는 “서비스”의 일부 또는 전부를 “회사”의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 
    이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.<br/>

4. “회원”은 신청한 “클럽”,“미팅”에 대한 “서비스”의 권리를 타인에게 양도할 수 없습니다.<br/><br/>

제 15 조 [정보의 제공 및 광고의 게재]<br/>
1. “회사”는 회원이 서비스 이용 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편 등의 방법으로 회원에게 제공할 수 있습니다. 
    다만, 회원은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있습니다.<br/>

2. 제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는 경우에는 회원의 사전 동의를 받아<br/>

3. “회사”는 서비스의 운영과 관련하여 “서비스” 화면, 홈페이지, 전자우편 등에 광고를 게재할 수 있습니다. 
    해당 광고에는 “회원”의 “게시물” 및 “서비스” 중 이루어지는 사진촬영의 결과물 등이 포함될 수 있습니다.<br/>

4. 광고가 게재된 전자우편을 수신한 회원은 수신거절을 “회사”에게 할 수 있습니다.<br/>

5. 이용자는 “회사”가 제공하는 “서비스”와 관련하여 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.<br/>

6. 회원은 언제든지 고객센터 등을 통해 광고에 게재된 자신의 게시물과 자신의 사진 등에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 취할 수 있습니다.<br/><br/>

제 16 조 [회원의 게시물]<br/>
1. 회원이 서비스 내에 게시한 “게시물”의 저작권은 해당 게시물의 저작자에게 귀속됩니다.<br/>

2. 회원이 서비스 내에 게시하는 게시물은 검색결과 내지 서비스 및 관련 프로모션과 광고 등에 노출될 수 있으며, 
    해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, “회사”는 저작권법 규정을 준수하며, 
    회원은 언제든지 고객센터 등을 통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 취할 수 있습니다.<br/>

3. “회사”는 제2항 이외의 방법으로 회원의 게시물을 이용하고자 하는 경우에는 전화, 문자메시지, 전자우편 등을 통해 사전에 회원의 동의를 얻어야 합니다.<br/>

4. “회사”는 “회원”이 게시하거나 등록하는 “게시물”이 다음 각 호에 해당한다고 판단되는 경우 사전통지 없이 삭제할 수 있고, 이에 대하여 “회사”는 어떠한 책임도 지지 않습니다.<br/>

(1) 다른 회원 또는 제 3자를 비방하거나 명예를 손상시키는 내용인 경우<br/>

(2) 사회의 미풍양속에 위반되는 경우<br/>

(3) “회사”의 저작권 및 제3자의 저작권 등 기타 권리를 침해하는 경우<br/>

(4) “회사”로부터 사전 승인받지 아니한 상업광고, 판촉내용을 게시하는 경우<br/>

(5) “회사”의 “서비스”와 관련 없는 내용인 경우<br/>

(6) 정당한 사유 없이 “회사”의 영업을 방해하는 내용인 경우<br/>

(7) 기타 관계법령에 위반된다고 판단되는 경우<br/><br/>

제 17 조 [권리의 귀속]<br/>
서비스에 대한 저작권 및 지적재산권은 “회사”에 귀속됩니다. “회원”은 “서비스”를 이용함으로써 얻은 정보를 “회사”의 사전 승낙 없이 
  복제, 송신, 출판, 배포, 방송 등 기타 방법에 의하여 이용하거나 제3자에게 이용하게 하여서는 안됩니다. 단, 회원의 게시물 및 제휴계약에 따라 제공된 저작물 등은 제외합니다.<br/>
<br/>
제 18 조 [이용계약의 해지]<br/>
1. 회원은 언제든지 “회사”에게 해지의사를 통지함으로써 이용계약을 해지할 수 있으며, “회사”는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.<br/>

2. 회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 “회사”가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 데이터는 소멸됩니다.<br/>

3. 회원이 작성한 게시물 등은 삭제되지 않으니 사전에 삭제 후 탈퇴하여야 합니다.<br/>

4. “회사”는 원활한 “서비스” 제공의 곤란 및 수익성 악화에 따라 임의로 계약을 해지할 수 있습니다. 이 경우에, “회사”는 관련 정보를 이용계약을 체결한 “회원”에게 통지하여야 합니다.<br/>

5. “회사”는 각호에 해당되는 사유가 있는 경우, 이용계약을 해지할 수 있습니다. 이 경우 “회사”는 회원에게 전자우편, 전화 등 기타의 방법을 통하여 해지사유를 밝혀 해지의사를 통지합니다.<br/>

• “회원”이 “회사”나 다른 회원, 기타 타인의 권리나 명예, 신용을 침해하는 행위를 한 경우<br/>

• 기타 회원이 이 약관에 위배되는 행위를 하거나 이 약관에서 정한 해지사유가 발생한 경우<br/>

6. 이용계약이 종료되는 경우 환불 등의 처리에 관하여는 “회사”의 환불규정에 의합니다.<br/>

7. 이용계약의 종료와 관련하여 발생한 손해는 이용계약이 종료된 해당 회원이 책임을 부담하고 “회사”는 일체의 책임을 지지 않습니다.<br/><br/>

제 19 조 [환불 규정]<br/>
1. “회사”와 “서비스” 구매에 대한 계약을 체결한 “회원”은 환불 정책 기준에 따라 “클럽,미팅” 모임일 기준 3일 전까지 환불을 요청할 수 있습니다. 
    “회사”는 아래 규정에 따라 “회원”에게 환불합니다.<br/>

• 호스트가 “클럽”,“미팅”을 삭제한 경우: 전액 환불<br/>

• 호스트가 날짜, 장소 등 “클럽”,“미팅”의 상세 정보를 변경한 경우: 전액 환불<br/>

• 참여 대기 “클럽”,“미팅” 참여 거절된 경우: 전액 환불<br/>

• 참여 확정 “클럽”,“미팅” 모임 당일 기준 3일 전까지: 전액 환불<br/>

• 참여 확정 “클럽”,“미팅” 모임 당일 기준 3일 이내: 환불 불가<br/><br/>

제 20 조 [면책조항]<br/>
1. “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.<br/>

2. “회사”는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다.<br/>

3. “회사”는 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않으며, 
    그 밖의 “서비스”를 통하여 얻은 자료로 인한 손해에 관한 책임을 지지 않습니다.<br/>

4. “회사”는 “회원”이 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관해서는 책임을 지지 않습니다.<br/>

5. “회사”는 무료로 제공되는 “서비스” 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.<br/>

6. “회사”는 “회원”간 또는 “회원”과 제3자 상호간에 “서비스”를 매개로 하여 거래 등을 한 경우에는 책임을 지지 않습니다.<br/><br/>

제 21 조 [준거법 및 재판관할]<br/>
1. “회사”와 회원 간 제기된 소송은 대한민국의 법을 적용합니다.<br/>

2. “서비스” 이용 중 발생한 “회사”와 회원 간 분쟁에 관한 소송은 제소 당시의 “회사”의 주소지를 관할하는 지방법원의 관할로 합니다.<br/>
<br/>
부칙<br/>
1. 이 약관은 2023년 06월 27일부터 시행합니다.<br/>

2.이 개정약관은 시행일 이후에 체결되는 계약에만 적용되고 그 이전에 체결된 계약에 대해서는 개정전의 약관조항을 그대로 적용합니다.<br/>
      </Typography>
    </Box>
    </>
  );
};

export default TermsOfGaga;
